package week2;

//****************************************************
// GenArray.java           class fundations
// 数组生成类
//****************************************************
public class GenArray {
    //---------------------------------------------
    // 生成并返回一个长度为1000，有序，不连续的整数数组
    //---------------------------------------------
    public int[] GenArrayProcess() {
        int[] arr = new int[1000];
        for (int i = 0; i < 2000; i++) {
            if (i % 2 == 0) // 为偶数时，存储
            {
                arr[i/2] = i;
            }
        }
        return arr;
    }
}
