package week2;

//****************************************************
// GenArray.java           class fundations
// 数组生成类
//****************************************************
public class GenArray {
    //---------------------------------------------
    // 生成并返回一个长度为1000的不连续的整数数组
    //---------------------------------------------
    public int[] GenArrayProcess() {
        int[] arr = new int[1000];
        for (int i = 0; i < 1000; i++) {
            arr[i] = i * (i % 2 == 1 ? 1 : -1); // 对 i 交叉取反（正|负）存储
        }
        return arr;
    }
}
